CFDcode_specific_extension_files/OpenFOAm_v2006/openfoam_example_files/test1_inflow_boundary_only/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    ( 0.0 19.0 0.0)
    ( 150.0 19.0 0.0)
    ( 150.0 21.0 0.0)
    ( 0.0 21.0 0.0)
    ( 0.0 19.0 15.0)
    ( 150.0 19.0 15.0)
    ( 150.0 21.0 15.0)
    ( 0.0 21.0 15.0)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (375 5 60) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 5 6 2)
        );
    }
    ground
    {
        type wall;
        faces
        (
            (0 1 2 3)
        );
    }
    top
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
    sides1
    {
        type patch;
        faces
        (
            (0 1 5 4)
        );
    }
    sides2
    {
        type patch;
        faces
        (
            (3 2 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
